{
  "theme": {
    "primaryColor": "#003a45",
    "backgroundColor": "#F8FAFC",
    "textColor": "#0F172A"
  },
  "sections": {
    "about": "Desenvolvedor Full-Stack Web",
    "skills": [
      "TypeScript",
      "React",
      "Next.js",
      "Node.js",
      "C#",
      ".NET",
      "Tailwind CSS",
      "PostgreSQL",
      "Jest"
    ],
    "experience": [
      {
        "title": "Desenvolvedor Full-Stack Pleno",
        "company": "Movida Carro Por Assinatura",
        "period": "Out 2023 - Presente",
        "summary": "Na Movida, conduzi a modernização de um sistema legado de contratos com front-end em Angular 16 e micro frontends, integrando APIs em .NET 8 e C# para novas funcionalidades. Apliquei RxJS e NgRx para consistência de estado e desempenho, e utilizei Docker para padronizar ambientes de desenvolvimento e deploy. Em parceria com produto, trabalhei orientação a dados para otimizar UX, reduzindo retrabalho e elevando a adoção por usuários internos. Mantive pipeline de CI/CD com Jenkins em integração contínua, assegurando releases frequentes com testes automatizados em TypeScript/Jest e validação de endpoints REST protegidos por JWT."
      },
      {
        "title": "Desenvolvedor Full-Stack Pleno",
        "company": "Fazenda São Francisco",
        "period": "Out 2022 - Out 2023",
        "summary": "Reestruturei um monolito para uma arquitetura de microsserviços, expondo APIs RESTful seguras com autenticação JWT e implementando testes automatizados com Jest para aumentar a confiabilidade. Desenvolvi serviços com NestJS e PostgreSQL/TypeORM e conteinerizei componentes com Docker, o que acelerou o ciclo de entrega e simplificou a observabilidade e manutenção. A nova topologia de serviços reduziu o tempo de deploy e facilitou integrações com BI; os pipelines de CI/CD em Jenkins garantiram versionamento consistente e verificações automáticas em TypeScript e JavaScript, alinhando-se a práticas de clean code e padrões de integração entre serviços."
      },
      {
        "title": "Desenvolvedor Full-Stack",
        "company": "B-Tech",
        "period": "Jun 2020 - Out 2022",
        "summary": "Mantive e evoluí aplicações internas em PHP e Laravel com Vue.js e MySQL, refatorando o módulo de faturamento para processamento assíncrono com filas em Redis, o que reduziu em mais de 70% o tempo médio de geração de relatórios. Estruturei endpoints REST e padronizei contratos para facilitar consumo por front-ends em JavaScript/TypeScript e React quando necessário. Introduzi práticas de testes automatizados e pipeline de integração contínua com Jenkins, além de conteinerização com Docker em serviços elegíveis, melhorando previsibilidade de deploy e estabilidade em produção."
      },
      {
        "title": "Desenvolvedor Web Full-Stack",
        "company": "Capital Nerd",
        "period": "Mar 2018 - Jun 2020",
        "summary": "Atendi pequenas empresas construindo sistemas sob demanda com React e Next.js integrados a APIs externas, utilizando MongoDB quando a flexibilidade de dados era prioritária. Em um projeto de delivery, implementei geolocalização com atualização em tempo real e integrações REST, garantindo performance no front-end em JavaScript/TypeScript e robustez no backend. Mantive foco em performance e entregas consistentes, com uso de Docker em ambientes de desenvolvimento e boas práticas de versionamento, além de experiência prévia com Angular e variações como micro frontends conforme a necessidade."
      }
    ]
  }
}
